posts/courses/deep-learning/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Deap Learning in Udacity | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/courses/deep-learning/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../../reading/akka-in-action/" title="Akka In Action" type="text/html">
<link rel="next" href="../domain-driven-design/" title="Domain Driven Design in Practise" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Deap Learning in Udacity">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/courses/deep-learning/">
<meta property="og:description" content="Table of Contents


Deep Learning in udacity.com
Logistic Classifier






Deep Learning in udacity.com


Classification for Detection:
To change a detection problem to a classification problem.
For e">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="deep learning">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Deap Learning in Udacity</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Deep Learning in udacity.com</a></li>
<li><a href="#sec-2">Logistic Classifier</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Deep Learning in udacity.com</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Classification for Detection:
<b>To change a detection problem to a classification problem</b>.
For example, to detect pedestrian from an image, use a classifier to
classify small patches of image into two classes: pedestrain and
non-pedestrain. Then run the classifier over the images's patches.
</li>
<li>Classification for Ranking:
Use a classifier that ranks the pair (query, webpage) as input and
classify the pair as relevant/not levant. Search Engine can use the
classifier for only promising candidate webpages.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Logistic Classifier</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>A logistic classifier called linear classifier. It applies an linear
function to the input to generate its predictions.
</li>
<li>Using <b>SOFTMAX</b> function to turn the output score to probabilities, in which
the correct class will hve a probablitity close to 1 and otherwise
close to 0.
<ul class="org-ul">
<li>Also called normalized exponential function, it "squashes" a
arbitrary k-dimensinal vector of real values to a k-dimensinal
vector of real values in the range of (0,1) that add up to 1.
</li>
<li>The function:
\begin{equation}
\sigma(\mathbf{z})_j = \frac{e^{z_j}}{\sum_{k=1}^K e^{z_k}}  \text{for } j=1..k
\end{equation}
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/deep-learning/" rel="tag">deep learning</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../../reading/akka-in-action/" rel="prev" title="Akka In Action">Previous post</a>
            </li>
            <li class="next">
                <a href="../domain-driven-design/" rel="next" title="Domain Driven Design in Practise">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
